; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_7_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 - counter
	)
  (:init
		(= (value c0) 71)
	(= (value c1) 23)
	(= (value c2) 26)
	(= (value c3) 41)
	(= (value c4) 87)
	(= (value c5) 44)
	(= (value c6) 97)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
		)
	)
)

; plan
1. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 4 of 6
2. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 4 of 6
3. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 4 of 6
4. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 4 of 6
5. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 4 of 6
6. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 4 of 6
7. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 4 of 6
8. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 4 of 6
9. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 4 of 6
10. (increment c5)
   changed: (value c5) from 44 to 50
   goals met: 4 of 6
11. (increment c5)
   changed: (value c5) from 50 to 56
   goals met: 4 of 6
12. (increment c5)
   changed: (value c5) from 56 to 62
   goals met: 4 of 6
13. (increment c5)
   changed: (value c5) from 62 to 68
   goals met: 4 of 6
14. (increment c5)
   changed: (value c5) from 68 to 74
   goals met: 4 of 6
15. (increment c5)
   changed: (value c5) from 74 to 80
   goals met: 4 of 6
16. (increment c5)
   changed: (value c5) from 80 to 86
   goals met: 4 of 6
17. (increment c5)
   changed: (value c5) from 86 to 92
   goals met: 5 of 6
18. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 5 of 6
19. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 5 of 6
20. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 5 of 6
21. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 5 of 6
22. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 5 of 6
23. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 5 of 6
24. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 5 of 6
25. (increment c1)
   changed: (value c1) from 23 to 30
   goals met: 4 of 6
26. (increase_rate c1)
   changed: (rate_value c1) from 7 to 8
   goals met: 4 of 6
27. (increase_rate c1)
   changed: (rate_value c1) from 8 to 9
   goals met: 4 of 6
28. (increment c1)
   changed: (value c1) from 30 to 39
   goals met: 4 of 6
29. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 4 of 6
30. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 4 of 6
31. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 4 of 6
32. (decrement c1)
   changed: (value c1) from 39 to 30
   goals met: 4 of 6
33. (increase_rate c1)
   changed: (rate_value c1) from 9 to 10
   goals met: 4 of 6
34. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 4 of 6
35. (increment c1)
   changed: (value c1) from 30 to 40
   goals met: 4 of 6
36. (decrement c0)
   changed: (value c0) from 71 to 67
   goals met: 4 of 6
37. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 4 of 6
38. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 4 of 6
39. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 4 of 6
40. (increment c2)
   changed: (value c2) from 26 to 29
   goals met: 4 of 6
41. (increase_rate c0)
   changed: (rate_value c0) from 4 to 5
   goals met: 4 of 6
42. (increase_rate c0)
   changed: (rate_value c0) from 5 to 6
   goals met: 4 of 6
43. (decrement c0)
   changed: (value c0) from 67 to 61
   goals met: 4 of 6
44. (decrement c0)
   changed: (value c0) from 61 to 55
   goals met: 4 of 6
45. (decrement c0)
   changed: (value c0) from 55 to 49
   goals met: 4 of 6
46. (decrement c0)
   changed: (value c0) from 49 to 43
   goals met: 4 of 6
47. (decrement c0)
   changed: (value c0) from 43 to 37
   goals met: 5 of 6
48. (increment c2)
   changed: (value c2) from 29 to 32
   goals met: 5 of 6
49. (increment c2)
   changed: (value c2) from 32 to 35
   goals met: 5 of 6
50. (increment c2)
   changed: (value c2) from 35 to 38
   goals met: 5 of 6
51. (decrement c1)
   changed: (value c1) from 40 to 30
   goals met: 5 of 6
52. (decrement c0)
   changed: (value c0) from 37 to 31
   goals met: 5 of 6
53. (decrement c0)
   changed: (value c0) from 31 to 25
   goals met: 6 of 6
